In [1]:
import numpy as np
import pandas as pd

In [25]:
df = pd.DataFrame(np.random.randn(5,4), index=list('ABCDE'), columns=list('WXYZ'))
df

          W         X         Y         Z
A  1.351291  0.974556  0.317993  0.936007
B  1.189876 -0.427111  1.150134  0.141017
C -0.330075  0.751429  1.335203 -0.722127
D -0.530514 -1.843085 -0.352158  0.545628
E  1.385232 -0.045177 -0.690987  0.739344

In [28]:
df['W']

A    1.351291
B    1.189876
C   -0.330075
D   -0.530514
E    1.385232
Name: W, dtype: float64

In [29]:
df[['W', 'Z']]

          W         Z
A  1.351291  0.936007
B  1.189876  0.141017
C -0.330075 -0.722127
D -0.530514  0.545628
E  1.385232  0.739344

In [30]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [31]:
df['baru'] = df['W'] + df['Y']

In [32]:
df

          W         X         Y         Z      baru
A  1.351291  0.974556  0.317993  0.936007  1.669284
B  1.189876 -0.427111  1.150134  0.141017  2.340010
C -0.330075  0.751429  1.335203 -0.722127  1.005128
D -0.530514 -1.843085 -0.352158  0.545628 -0.882672
E  1.385232 -0.045177 -0.690987  0.739344  0.694245

In [33]:
df.drop('baru', axis=1, inplace=True)

In [34]:
df

          W         X         Y         Z
A  1.351291  0.974556  0.317993  0.936007
B  1.189876 -0.427111  1.150134  0.141017
C -0.330075  0.751429  1.335203 -0.722127
D -0.530514 -1.843085 -0.352158  0.545628
E  1.385232 -0.045177 -0.690987  0.739344

In [35]:
df.drop('E', axis=0)

          W         X         Y         Z
A  1.351291  0.974556  0.317993  0.936007
B  1.189876 -0.427111  1.150134  0.141017
C -0.330075  0.751429  1.335203 -0.722127
D -0.530514 -1.843085 -0.352158  0.545628

In [36]:
df.loc['B']

W    1.189876
X   -0.427111
Y    1.150134
Z    0.141017
Name: B, dtype: float64

In [37]:
df.iloc[1]

W    1.189876
X   -0.427111
Y    1.150134
Z    0.141017
Name: B, dtype: float64

In [38]:
df.loc[df.index[2], 'W']

-0.33007544924679133

In [39]:
df.loc['C', 'W']

-0.33007544924679133

In [40]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False   True   True
C  False   True   True  False
D  False  False  False   True
E   True  False  False   True

In [41]:
df[df > 0]

          W         X         Y         Z
A  1.351291  0.974556  0.317993  0.936007
B  1.189876       NaN  1.150134  0.141017
C       NaN  0.751429  1.335203       NaN
D       NaN       NaN       NaN  0.545628
E  1.385232       NaN       NaN  0.739344

In [43]:
df[df['W']>0]

          W         X         Y         Z
A  1.351291  0.974556  0.317993  0.936007
B  1.189876 -0.427111  1.150134  0.141017
E  1.385232 -0.045177 -0.690987  0.739344

In [46]:
df[df['W']>0][['Y', 'X']]

          Y         X
A  0.317993  0.974556
B  1.150134 -0.427111
E -0.690987 -0.045177

In [51]:
df[(df['W']>0) & (df['X']>0)]

          W         X         Y         Z
A  1.351291  0.974556  0.317993  0.936007

In [52]:
df[(df['W']>0) | (df['X']>0)]

          W         X         Y         Z
A  1.351291  0.974556  0.317993  0.936007
B  1.189876 -0.427111  1.150134  0.141017
C -0.330075  0.751429  1.335203 -0.722127
E  1.385232 -0.045177 -0.690987  0.739344

In [55]:
df.reset_index(inplace=True)

In [56]:
df

  index         W         X         Y         Z
0     A  1.351291  0.974556  0.317993  0.936007
1     B  1.189876 -0.427111  1.150134  0.141017
2     C -0.330075  0.751429  1.335203 -0.722127
3     D -0.530514 -1.843085 -0.352158  0.545628
4     E  1.385232 -0.045177 -0.690987  0.739344

In [58]:
df['code'] = 'IND JPN USA RSA IND'.split()
df

  index         W         X         Y         Z code
0     A  1.351291  0.974556  0.317993  0.936007  IND
1     B  1.189876 -0.427111  1.150134  0.141017  JPN
2     C -0.330075  0.751429  1.335203 -0.722127  USA
3     D -0.530514 -1.843085 -0.352158  0.545628  RSA
4     E  1.385232 -0.045177 -0.690987  0.739344  IND

In [62]:
df.set_index('code', inplace=True)

KeyError: "None of ['code'] are in the columns"

In [63]:
df

     index         W         X         Y         Z
code
IND      A  1.351291  0.974556  0.317993  0.936007
JPN      B  1.189876 -0.427111  1.150134  0.141017
USA      C -0.330075  0.751429  1.335203 -0.722127
RSA      D -0.530514 -1.843085 -0.352158  0.545628
IND      E  1.385232 -0.045177 -0.690987  0.739344

In [66]:
df.drop('index', axis=1, inplace=True)

In [67]:
df

             W         X         Y         Z
code
IND   1.351291  0.974556  0.317993  0.936007
JPN   1.189876 -0.427111  1.150134  0.141017
USA  -0.330075  0.751429  1.335203 -0.722127
RSA  -0.530514 -1.843085 -0.352158  0.545628
IND   1.385232 -0.045177 -0.690987  0.739344

In [70]:
dataLabels = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
dataValues = [1, 2, 3, 1, 2, 3]
tuples = list(zip(dataLabels, dataValues))
tuples

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [73]:
index = pd.MultiIndex.from_tuples(tuples)
index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [75]:
df1 = pd.DataFrame(np.random.randn(6, 2), index=index, columns=list('AB'))
df1

             A         B
G1 1 -0.564194  0.035067
   2 -1.326983 -1.018241
   3  0.854736 -0.063256
G2 1 -0.309258 -1.357524
   2  2.093887 -0.187704
   3  0.390125  0.465176

In [76]:
df1.loc['G1']

          A         B
1 -0.564194  0.035067
2 -1.326983 -1.018241
3  0.854736 -0.063256

In [77]:
df1.loc['G1'].loc[3]

A    0.854736
B   -0.063256
Name: 3, dtype: float64

In [78]:
df1.index.names

FrozenList([None, None])

In [81]:
df1.index.names = ['Group', 'Num']
df1

                  A         B
Group Num
G1    1   -0.564194  0.035067
      2   -1.326983 -1.018241
      3    0.854736 -0.063256
G2    1   -0.309258 -1.357524
      2    2.093887 -0.187704
      3    0.390125  0.465176

In [83]:
df1.xs('G1')

            A         B
Num
1   -0.564194  0.035067
2   -1.326983 -1.018241
3    0.854736 -0.063256

In [84]:
df1.xs(['G1', 2])

A   -1.326983
B   -1.018241
Name: (G1, 2), dtype: float64

In [85]:
df1.xs(1, level='Num')

              A         B
Group
G1    -0.564194  0.035067
G2    -0.309258 -1.357524